DiedlF/sw_sensor/sw_stm32/Core/Src/watchdog_handler.cpp
/** *****************************************************************************
 * @file    	watchdog_handler.cpp
 * @brief   	initialize and service watchdog (with medium priority)
 * @author  	Dr. Klaus Schaefer
 * @copyright 	Copyright 2021 Dr. Klaus Schaefer. All rights reserved.
 * @license 	This project is released under the GNU Public License GPL-3.0

    <Larus Flight Sensor Firmware>

    This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>.

 **************************************************************************/

#include "system_configuration.h"
#include "main.h"
#include "FreeRTOS_wrapper.h"
#include "stm32f4xx_hal.h"

#define SD_DETECT_PIN         GPIO_PIN_13
#define SD_DETECT_GPIO_PORT   GPIOC

COMMON Semaphore watchdog_activator(1,0,(char *)"WATCH_ACTIVATOR");

static COMMON WWDG_HandleTypeDef WwdgHandle;
extern bool user_initiated_reset;

bool SD_is_plugged_in( void)
{
  return HAL_GPIO_ReadPin(SD_DETECT_GPIO_PORT, SD_DETECT_PIN) == GPIO_PIN_SET;
}

void heartbeat (void)
{
  bool set = GPIO_PIN_SET
      == HAL_GPIO_ReadPin ( LED_STATUS3_GPIO_Port, LED_STATUS3_Pin);
  HAL_GPIO_WritePin (LED_STATUS3_GPIO_Port, LED_STATUS3_Pin,
		     set ? GPIO_PIN_RESET : GPIO_PIN_SET);
}

#if WATCHDOG_STATISTICS
COMMON volatile uint32_t watchdog_min=0xffffffff;
COMMON volatile uint32_t watchdog_max=0;
#endif

void initialize_watchdog(void)
{
  __HAL_RCC_WWDG_CLK_ENABLE();
  WwdgHandle.Instance = WWDG;
  WwdgHandle.Init.Prescaler = WWDG_PRESCALER_8;
  WwdgHandle.Init.Window = 0x60;
  WwdgHandle.Init.Counter = 127;
  WwdgHandle.Init.EWIMode=WWDG_EWI_ENABLE;

  NVIC_SetPriority ((IRQn_Type) WWDG_IRQn, WATCHDOG_ISR_PRIORITY);
  NVIC_EnableIRQ ((IRQn_Type) WWDG_IRQn);

  if (HAL_WWDG_Init (&WwdgHandle) != HAL_OK)
    Error_Handler ();
}

void watchdog_runnable (void*)
{
  watchdog_activator.wait();

#if ACTIVATE_WATCHDOG

  acquire_privileges();
  initialize_watchdog();
  drop_privileges();

#endif // ACTIVATE_WATCHDOG

  bool sd_was_plugged = SD_is_plugged_in();
  bool sd_state_initialized = false;
  uint8_t sd_stable_counter = 0;
  uint16_t startup_grace_ticks = 50; // ~2 seconds @ 40 ms

  uint8_t rythm = 0;
  for (synchronous_timer t (40); true;)
    {
      t.sync ();
      if( (++rythm & 0x0f) ==0)
	  HAL_GPIO_TogglePin (LED_STATUS3_GPIO_Port, LED_STATUS3_Pin);

#if ACTIVATE_WATCHDOG
#if WATCHDOG_STATISTICS
      uint32_t watchdog_actual = WwdgHandle.Instance->CR & 0x7f;
      if( watchdog_actual > watchdog_max)
	watchdog_max = watchdog_actual;
      if( watchdog_actual < watchdog_min)
	watchdog_min = watchdog_actual;
#endif
      HAL_WWDG_Refresh (&WwdgHandle);

      bool sd_is_plugged = SD_is_plugged_in();
      if( sd_is_plugged == sd_was_plugged)
	{
	  if( sd_stable_counter < 255)
	    ++sd_stable_counter;
	}
      else
	{
	  sd_stable_counter = 0;
	}

      if( ! sd_state_initialized)
	{
	  if( sd_stable_counter >= 3)
	    sd_state_initialized = true;
	}
      else if( startup_grace_ticks == 0)
	{
	  // SD hotplug is handled inside the uSD task now.
	  // Do not force a full watchdog reset on card insertion, because that can
	  // create a reboot loop when the card or filesystem is slow/problematic.
	}

      if( startup_grace_ticks > 0)
	--startup_grace_ticks;
      sd_was_plugged = sd_is_plugged;
#endif
    }
}

COMMON RestrictedTask watchdog_handler ( watchdog_runnable, "WATCHDOG", configMINIMAL_STACK_SIZE, 0, WATCHDOG_TASK_PRIORITY);

extern "C" void handle_watchdog_trigger( void);

unsigned watchdog_counter = 0;
void HAL_WWDG_EarlyWakeupCallback(WWDG_HandleTypeDef *handle)
{
  ++watchdog_counter;	// give time for the uSD system to record the crash
  if( watchdog_counter < 100) // then allow the watchdog to reset the uContoller
    HAL_WWDG_Refresh (handle);
}

extern "C" void WWDG_IRQHandler(void)
{
  HAL_WWDG_IRQHandler(&WwdgHandle);
  if( watchdog_counter < 2) // do this just once, watchdog_counter already incremented to 1
    handle_watchdog_trigger();
}
